## import libraries

In [ ]:
import pandas as pd

In [64]:
data = pd.read_excel('data34604.xlsx')
data

      Price        Size
0  $250,000   4.5 acres
1  $155,999   4.2 acres
2   $69,900  1.25 acres
3  $184,900   2.5 acres
4  $184,900   2.5 acres
5   $34,000  0.34 acres
6   $56,000   0.7 acres
7  $220,000   4.6 acres
8  $389,000     2 acres

## Cleaning data after scraping it from the extension

In [65]:
data['Size'] = data['Size'].str.replace('[^\d.]', '').astype(float)
data['Price'] = data['Price'].str.replace('$', '')
data['Price'] = data['Price'].str.replace(',', '').astype(float)

C:\Users\Horus\AppData\Local\Temp\ipykernel_29192\2401074792.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  data['Size'] = data['Size'].str.replace('[^\d.]', '').astype(float)
C:\Users\Horus\AppData\Local\Temp\ipykernel_29192\2401074792.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  data['Price'] = data['Price'].str.replace('$', '')

In [66]:
data

      Price  Size
0  250000.0  4.50
1  155999.0  4.20
2   69900.0  1.25
3  184900.0  2.50
4  184900.0  2.50
5   34000.0  0.34
6   56000.0  0.70
7  220000.0  4.60
8  389000.0  2.00

## Make a column for price per acre

In [67]:
data['Price_per_acre'] = data['Price'] / data['Size']

In [68]:
data

      Price  Size  Price_per_acre
0  250000.0  4.50    55555.555556
1  155999.0  4.20    37142.619048
2   69900.0  1.25    55920.000000
3  184900.0  2.50    73960.000000
4  184900.0  2.50    73960.000000
5   34000.0  0.34   100000.000000
6   56000.0  0.70    80000.000000
7  220000.0  4.60    47826.086957
8  389000.0  2.00   194500.000000

## Deleting OutLiers from the data and saving it to data_no_outliers

In [69]:
# Calculate Quartiles
Q1 = data['Price_per_acre'].quantile(0.25)
Q3 = data['Price_per_acre'].quantile(0.75)

# Calculate IQR
IQR = Q3 - Q1

# Define thresholds for outliers
lower_threshold = Q1 - 1.5 * IQR
upper_threshold = Q3 + 1.5 * IQR

# Filter out outliers
data_no_outliers = data[(data['Price_per_acre'] >= lower_threshold) & (data['Price_per_acre'] <= upper_threshold)]

## Read the data after removing the outliers

In [70]:
data_no_outliers

      Price  Size  Price_per_acre
0  250000.0  4.50    55555.555556
1  155999.0  4.20    37142.619048
2   69900.0  1.25    55920.000000
3  184900.0  2.50    73960.000000
4  184900.0  2.50    73960.000000
5   34000.0  0.34   100000.000000
6   56000.0  0.70    80000.000000
7  220000.0  4.60    47826.086957

## Calculate the avg PPA

In [71]:
data_no_outliers['Price_per_acre'].median()

64940.0

## Calculate the offer

In [72]:
Avg_PPA = data_no_outliers['Price_per_acre'].median()*0.4*0.4
Avg_PPA

10390.400000000001